<template>
  <div class="main-bg bg-blue">
  <div class="container">
    <div class="d-flex justify-content-center align-items-center mh-100">
        <div class="bg-white  text-center py-3 px-3 rounded">
        <h3>ข้อตกลงและการใช้งาน</h3>
        <div class="terms text-left bg-white my-3 py-3 px-2">
          <ol>
            <li>โปรดอ่านข้อตกลงการใช้บริการอย่างถี่ถ้วน การใช้บริการ (ตามที่ระบุไว้) ถือว่าคุณได้ยอมรับว่าคุณได้อ่าน และเข้าใจในข้อกำหนดต่างๆ ในข้อตกลงการใช้งานที่กำหนดไว้ใช้กับคุณ ข้อกำหนดต่างๆ นี้ ถือเป็นข้อตกลงที่มีผลผูกพันทางกฎหมาย (“ข้อตกลง”) หากคุณไม่ยินยอมต่อข้อตกลงการใช้บริการ โปรดยกเลิกการใช้งาน หรือหยุดการใช้งานแอปพลิเคชันหรือการบริการ</li>
            <li>พาร์คคลาวด์คือบริษัททางเทคโนโลยี ที่ให้บริการแพลตฟอร์มสำหรับผู้ใช้งาน เพื่อรับการบริการ ที่ให้บริการโดยผู้ให้บริการบุคคลที่สาม หน้าที่ของเราคือเป็นตัวกลางสื่อสารระหว่างผู้ใช้งานกับผู้ให้บริการบุคคลที่สาม</li>
            <li>“ข้อมูลส่วนตัว” หมายถึง ข้อมูลที่ใช้ในการยืนยันตัวตนของคุณ หรือที่ยืนยันได้ว่าเป็นคุณ ซึ่งรวมถึงแต่ไม่จำกัดเพียง ชื่อของคุณ, สัญชาติ, เบอร์โทรศัพท์, ข้อมูลธนาคารและบัตรเครดิต, อีเมล, ภาพของคุณ, เลขบัตรประชาชน, เชื้อชาติ, วันเกิด, สถานภาพสมรส, ศาสนา, ข้อมูลสุขภาพ, ข้อมูลยานพาหนะและประกันภัย</li>
            <li>“แพลตฟอร์ม” หมายถึง แพลตฟอร์มเทคโนโลยีที่เกี่ยวข้องกับพาร์คคลาวด์, หรือเว็บไซต์ที่เมื่อใช้เชื่อมต่อกับแอปพลิเคชัน จะทำให้ผู้ใช้งานสามารถทำเรื่องขอ หรือเข้าถึง คำตอบหรือวิธีการแก้ปัญหาต่าง ๆ</li>
            <li>“บริการ” หมายถึง การเชื่อมต่อระหว่างผู้ใช้งานกับผู้ให้บริการบุคคลที่สามผ่านทางแอปพลิเคชัน และ/หรือ แพลตฟอร์ม</li>
            <li>“ผู้ให้บริการบุคคลที่สาม” หมายถึง บุคคลที่สามอิสระ ที่มอบวิธีการแก่ปัญหาแก่ผู้ใช้งานผ่านการบริการ ซึ่งรวมถึงคนขับรถ และพ่อค้าบุคคลที่สาม</li>
            <li>“ผู้ใช้งาน” หมายถึง ผู้ใดก็ตามที่ใช้งานแอปพลิเคชัน และ/หรือ แพลตฟอร์ม เพื่อค้นหาและบรรลุทางเลือกและ</li>
            <li>“ค่าบริการผู้ใช้งาน” จึงหมายถึง ค่าบริการที่เกิดขึ้นจากผู้ใช้งาน โดยการใช้งานบริการเพื่อบรรลุทางเลือก ซึ่งรวมถึง ค่าบริการแอปพลิเคชันต่างๆ, ภาษีและค่าบริการ หรือค่าใช้จ่ายที่อาจเกิดขึ้นในการใช้งานเฉพาะกิจ ของบริการหรือทางเลือก</li>
            <li>
              ในการใช้บริการ คุณได้แสดง, อนุญาตและรับข้อผูกมัดว่า:
              <ol>
                <li>คุณมีอายุไม่ต่ำกว่ายี่สิบ (20) ปี หรือได้รับอนุญาตตามกฎหมายเพื่อเข้าร่วมข้อตกลง</li>
                <li>ข้อมูลทั้งหมดที่คุณมอบให้ เป็นข้อมูลตาจริงและถูกต้อง</li>
                <li>คุณจะใช้ แอปพลิเคชัน, แพลตฟอร์ม, บริการและทางเลือกตามหน้าที่ที่ได้กำหนดไว้และอยู่ภายใต้กฎหมาย</li>
                <li>คุณจะต้องเก็บรหัสผ่านบัญชีหรือข้อมูลยืนยันตัวซึ่งสามารถใช้เข้าถึงการบริการที่เรามอบให้ อย่างปลอดภัยและเป็นความลับ</li>
                <li>คุณตกลงที่จะแจ้งให้เราทราบทันทีเมื่อมีการใช้บัญชีของคุณโดยไม่ได้รับอนุญาตหรือ มีการละเมิดความปลอดภัยเกิดขึ้น</li>
                <li>คุณจะต้องไม่หาประโยชน์ทางการค้าจากแอปพลิเคชันโดยไม่ได้รับอนุญาต รวมถึงโดยไม่จำกัดถึง การปรับเปลี่ยนเนื้อหาใดๆ ของแอปพลิชั่น หรือคัดลอก, ทำใหม่, แสดงในที่สาธารณะ, จำหน่ายหรือใช้เพื่อการติดต่อทางธุรกิจและสาธารณะโดยไม่ได้รับอนุญาต</li>
                <li>คุณจะต้องไม่ให้ผู้อื่นใช้ข้อมูลส่วนตัวหรือสถานะผู้ใช้งานของคุณ และคุณไม่สามารถกำหนดหรือส่งต่อบัญชีผู้ใช้งานของคุณแก่ผู้ใดหรือสิ่งใดก็ตาม</li>
                <li>คุณจะต้องมอบหลักฐานยืนยันตน หรือเอกสารอื่นๆ, ใบอนุญาต, ใบอนุมัติ ซึ่งทางเราจะร้องขออย่างสมเหตุสมผล</li>
                <li>คุณจะต้องไม่ใช้แอปพลิเคชันในการเก็บหรือส่งสิ่งใดก็ตามที่ผิดกฎหมาย หรือ ใช้ในเชิงหลอกลวง</li>
                <li>คุณจะต้องไม่ใช้แอปพลิเคชันและ/หรือซอฟต์แวร์เพื่อก่อให้เกิดความรำคาญ หรือประพฤติไม่เหมาะสม หรือ ประพฤติอย่างไม่เคารพต่อแกร็บหรือ ผู้ให้บริการบุคคลที่สาม</li>
                <li>คุณจะต้องมอบข้อมูลที่เที่ยงตรง, เป็นปัจจุบันและสมบูรณ์ตามที่ร้องขอเพื่อการบริการและมีภาระผูกพันกับความรับผิดชอบต่อการดูแลและอัพเดทข้อมูลอย่างต่อเนื่องเพื่อให้มีความเที่ยงตรง, เป็นปัจจุบันและสมบูรณ์อยู่ตลอดเวลาระหว่างข้อกำหนดภายในข้อตกลง คุณยินยอมว่าแกร็บจะต้องพึ่งข้อมูลที่มีความเที่ยงตรง, เป็นปัจจุบันและสมบูรณ์ของคุณ คุณเข้าใจว่าหากข้อมูลของคุณนั้นไม่เป็นความจริง, ไม่มีความเที่ยงตรง, ไม่เป็นปัจจุบันและไม่สมบูรณ์ไม่ว่าในทางใดก็ตามแกร็บถือสิทธิแต่ไม่เป็นพันธะ ที่จะระงับข้อตกลงและระงับการใช้บริการของคุณโดยไม่ต้องแจ้งให้ทราบล่วงหน้า</li>
                <li>คุณยินยอมที่จะรับผิดชอบต่อความเสียหายหรือสูญหายที่เกิดจากตัวคุณเอง หรือจากฝ่ายอื่นๆที่มีผลมาจากการละเมิดข้อตกลงของคุณ</li>
              </ol>
            </li>
            <li>ความเข้ากันได้ โดยรูปแบบและเวอร์ชั่นของเราท์เตอร์ที่แตกต่างกัน, เบราว์เซอร์และอุปกรณ์อาจมีเฟิร์มแวร์ที่อาจจะไม่สามารถเข้ากันได้กับแอปพลิเคชัน, แพลตฟอร์มและ/หรือซอฟต์แวร์ ในระหว่างที่เราดำเนินการพัฒนาแอปพลิเคชัน, แพลตฟอร์มและ/หรือซอฟต์แวร์อย่างต่อเนื่อง เพื่อที่จะรองรับการใช้งานโดยอุปกรณ์และรูปแบบที่ใช้กันโดยทั่วไปในตลาดและเบราว์เซอร์ทั้งหมดที่มักจะถูกใช้เพื่อเข้าถึงที่แอปพลิเคชัน, แพลตฟอร์มและ/หรือซอฟต์แวร์ ให้มากที่สุดเท่าที่จะมากได้, เราไม่สามารถรับประกันถึงความเข้ากันได้ของแอปพลิเคชัน, แพลตฟอร์มและ/หรือซอฟต์แวร์ ต่ออุปกรณ์มือถือรุ่นหนึ่งรุ่นใด หรือฮาร์ดแวร์ใดได้</li>
            <li>
              การชำระเงิน
              <ol>
                <li>เมื่อคุณได้บรรลุการใช้บริการ คุณจะถูกร้องขอให้ชำระเงินจำนวนเต็มแต่ผู้บริการบุคคลที่สาม โดยเลือกหนึ่งในวิธีการชำระเงินที่สามารถใช้ได้ผ่านแอปพลิเคชัน การชำระเงินใดๆที่ตามมาในการเลือกนั้นจะไม่สามารถคืนเงินได้โดยอัตโนมัติ</li>
                <li>คุณอาจเลือกที่จะจ่ายผู้ให้บริการบุคคลที่สามสำหรับค่าใช้จ่ายในการแก้ปัญหาโดยเงินสดหรือวิธีใดๆก็ตามที่ทำได้, โดยบัตรเครดิตหรือบัตรเดบิต(“บัตร”) ที่ทำได้</li>
                <li>หากคุณเลือกที่จะจ่ายโดยบัตรคุณจะต้องลงทะเบียนบัตรที่สามารถใช้ได้ของคุณตามข้อมูลที่ระบุไว้ในแอปพลิเคชัน</li>
                <li>คุณยินยอมที่จะตรวจสอบและมอบข้อมูลของบัตรเมื่อลงทะเบียนบัตรกับเรา และเมื่อคุณใช้บริการ</li>
                <li>คุณยินยอมที่จะให้ความร่วมมือในเหตุที่มีความสัมพันธ์กับการป้องกันอาชญากรรมทางการเงิน ซึ่งจะมีการร้องขอให้ช่วยเหลือและสนับสนุนแกร็บตามกฎหมายและข้อกำหนดที่มีอยู่</li>
              </ol>
            </li>
            <li>
              การยกเลิก
              <ol>
                <li>คุณอาจยกเลิกคำร้องขอบริการขนส่งโดยยานพาหนะได้ทุกเวลาก่อนที่คุณจะขึ้นยานพาหนะของผู้ให้บริการบุคคลที่สาม ที่ได้รับการจับคู่กับคุณผ่านการบริการ</li>
                <li>หากคุณตัดสินใจที่จะยกเลิกการจองของคุณ หรือไม่ได้ไปยังสถานที่ที่นัดไว้กับคนขับ คุณจะถูกเก็บค่าบริการยกเลิกหรือ ค่าบริการยกเลิกอื่นๆที่พาร์คคลาวด์อาจระบุไว้เป็นครั้งคราวผ่าน นโยบายการยกเลิก</li>
              </ol>
            </li>
            <li>
              การประเมิน
              <ol>
                <li>ผู้ใช้งานและผู้ให้บริการบุคคลที่สามอาจจะได้รับการอนุญาตให้ประเมินกันและกันในส่วนของการให้บริการ การแก้ไขปัญหา</li>
                <li>ทุกๆการประเมินจะถูกบันทึกลงในระบบของแกร็บโดยอัตโนมัติ และแกร็บจะวิเคราะห์การประเมินที่ได้รับทั้งหมด แกร็บอาจจะกระทำการตามเห็นสมควรซึ่งรวมถึงการ ระงับการใช้บริการของคุณโดยไม่บอกล่วงหน้า หรือชดใช้ค่าใช้จ่ายใดๆแก่คุณ</li>
              </ol>
            </li>
          </ol>
        </div>
        <div><input type="checkbox" id="accept" name="accept" v-model="accepted" /><label class="ml-2" for="accept">ยอมรับเงื่อนไขที่ทางบริษัทกำหนด</label></div>
        <button :disabled="!accepted" @click="handleRegister" class="blue-btn btn rounded-pill bg-blue text-white mt-3">ลงทะเบียน</button>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import Vue from "vue";
export default Vue.extend({
  data() {
    return {
      accepted: false
    };
  },
  methods: {
    handleRegister() {
      this.$router.push({ name: "HomePage" });
    }
  }
});
</script>

<style lang="scss" scoped>
@import '../../styles/variables';
.container {
        @media screen and (max-width: 576px) {
            padding: 0px !important;
        }
    }
  h3 {
    font-family: 'Chonburi';
  }
    .main-bg {
        background-color: $blue;
    }

    .mh-100 {
      min-height: 100vh;
    }

.row {
  margin: auto;
  width: 40%;

  @media only screen and (max-width: 766px) {
    width: 80%;
  }
}

label {
  font-family: 'Chonburi';
}

.blue-btn {
  font-family: 'Chonburi';
}

.terms {
  overflow-y: scroll;
  height: 50vh;
}
</style>